; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v3 - type_1 ?v8 - type_2)
 	      (pred_2 ?v6 - object ?v8 - type_2)
	      (pred_4 ?v3 - type_1 ?v7 - type_3)
	      (pred_1 ?v3 - type_1 ?v6 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v3 - type_1 ?v5 ?v2 - type_2)
       :precondition (and  (pred_3 ?v3 ?v5))
       :effect (and  (pred_3 ?v3 ?v2)
		     (not (pred_3 ?v3 ?v5))))

   (:action op_1
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v1) (pred_3 ?v3 ?v1) (pred_4 ?v3 ?v7))
       :effect (and (pred_1 ?v3 ?v4 ?v7)
		    (not (pred_2 ?v4 ?v1)) 
		    (not (pred_4 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v4 ?v7) (pred_3 ?v3 ?v1))
       :effect (and (pred_2 ?v4 ?v1)
		    (pred_4 ?v3 ?v7)
		    (not (pred_1 ?v3 ?v4 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_03 - type_1
obj_13 obj_06 obj_08 obj_07 - type_3
obj_11 obj_14 obj_09 obj_05 - type_2
obj_02 obj_12 obj_10 obj_04 - object)
(:init
(pred_3 obj_01 obj_09)
(pred_4 obj_01 obj_13)
(pred_4 obj_01 obj_06)
(pred_3 obj_03 obj_14)
(pred_4 obj_03 obj_08)
(pred_4 obj_03 obj_07)
(pred_2 obj_02 obj_09)
(pred_2 obj_12 obj_14)
(pred_2 obj_10 obj_11)
(pred_2 obj_04 obj_14)
)
(:goal
(and
(pred_2 obj_02 obj_05)
(pred_2 obj_12 obj_11)
(pred_2 obj_10 obj_05)
(pred_2 obj_04 obj_14)
)
)

(:constraints
  (always (not (pred_3 obj_01 obj_05)))
)
)

; plan
1. (op_1 obj_01 obj_02 obj_09 obj_06)
   deleted: (pred_2 obj_02 obj_09) (pred_4 obj_01 obj_06)
   added: (pred_1 obj_01 obj_02 obj_06)
   goals met: 1 of 4
2. (op_1 obj_03 obj_12 obj_14 obj_07)
   deleted: (pred_2 obj_12 obj_14) (pred_4 obj_03 obj_07)
   added: (pred_1 obj_03 obj_12 obj_07)
   goals met: 1 of 4
3. (op_2 obj_03 obj_14 obj_11)
   deleted: (pred_3 obj_03 obj_14)
   added: (pred_3 obj_03 obj_11)
   goals met: 1 of 4
4. (op_2 obj_01 obj_09 obj_11)
   deleted: (pred_3 obj_01 obj_09)
   added: (pred_3 obj_01 obj_11)
   goals met: 1 of 4
5. (op_3 obj_03 obj_12 obj_11 obj_07)
   deleted: (pred_1 obj_03 obj_12 obj_07)
   added: (pred_2 obj_12 obj_11) (pred_4 obj_03 obj_07)
   goals met: 2 of 4
6. (op_3 obj_01 obj_02 obj_11 obj_06)
   deleted: (pred_1 obj_01 obj_02 obj_06)
   added: (pred_2 obj_02 obj_11) (pred_4 obj_01 obj_06)
   goals met: 2 of 4
7. (op_1 obj_03 obj_10 obj_11 obj_07)
   deleted: (pred_2 obj_10 obj_11) (pred_4 obj_03 obj_07)
   added: (pred_1 obj_03 obj_10 obj_07)
   goals met: 2 of 4
8. (op_2 obj_03 obj_11 obj_05)
   deleted: (pred_3 obj_03 obj_11)
   added: (pred_3 obj_03 obj_05)
   goals met: 2 of 4
9. (op_3 obj_03 obj_10 obj_05 obj_07)
   deleted: (pred_1 obj_03 obj_10 obj_07)
   added: (pred_2 obj_10 obj_05) (pred_4 obj_03 obj_07)
   goals met: 3 of 4
10. (op_2 obj_03 obj_05 obj_11)
   deleted: (pred_3 obj_03 obj_05)
   added: (pred_3 obj_03 obj_11)
   goals met: 3 of 4
11. (op_1 obj_03 obj_02 obj_11 obj_07)
   deleted: (pred_2 obj_02 obj_11) (pred_4 obj_03 obj_07)
   added: (pred_1 obj_03 obj_02 obj_07)
   goals met: 3 of 4
12. (op_2 obj_03 obj_11 obj_05)
   deleted: (pred_3 obj_03 obj_11)
   added: (pred_3 obj_03 obj_05)
   goals met: 3 of 4
13. (op_3 obj_03 obj_02 obj_05 obj_07)
   deleted: (pred_1 obj_03 obj_02 obj_07)
   added: (pred_2 obj_02 obj_05) (pred_4 obj_03 obj_07)
   goals met: 4 of 4
